<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 3 changes.</summary>

```diff
# module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
+ tailscale_tailnet_key.key will be created
+ terraform_data.tailscale_node_deletion_hook[0] will be created
+ time_rotating.rotate_tailnet_key will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 3 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-14T18:41:33Z [(view log)](https://github.com/perchnet/p/actions/runs/16275073833/job/45951875729#step:8:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
  ~ resource "proxmox_virtual_environment_vm" "coreos_vm" {
        id                      = "131"
      ~ ipv4_addresses          = [
            # (1 unchanged element hidden)
            [
                "192.168.1.105",
            ],
          - [],
          + [
              + "100.97.151.18",
            ],
          + [
              + "172.17.0.1",
            ],
        ]
      ~ ipv6_addresses          = [
            # (1 unchanged element hidden)
            [
                "fdfd:3a:a7ff::76b",
                "fdfd:3a:a7ff:0:e0de:caa6:210:43da",
                "2600:4808:6170:3a00:d631:1b7:873d:c3ed",
                "fe80::1dda:9485:f665:6128",
            ],
          - [
              - "fe80::5152:78c1:94d7:1511",
            ],
          + [
              + "fd7a:115c:a1e0::1101:9712",
              + "fe80::2219:bd8b:b761:a45a",
            ],
          + [],
        ]
      ~ mac_addresses           = [
            # (2 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "8A:D3:CE:CC:24:FA",
        ]
        name                    = "tf-coreos-periphery-I3k"
      ~ network_interface_names = [
            # (2 unchanged elements hidden)
            "tailscale0",
          + "docker0",
        ]
        tags                    = [
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tailscale_tailnet_key.key will be created
  + resource "tailscale_tailnet_key" "key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 3600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:periphery",
        ]
      + user_id       = (known after apply)
    }

  # terraform_data.tailscale_node_deletion_hook[0] will be created
  + resource "terraform_data" "tailscale_node_deletion_hook" {
      + id               = (known after apply)
      + input            = (sensitive value)
      + output           = (known after apply)
      + triggers_replace = "a088a553"
    }

  # time_rotating.rotate_tailnet_key will be created
  + resource "time_rotating" "rotate_tailnet_key" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_minutes = 60
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ tailscale_devices = [
      + {
          + addresses = [
              + "100.97.151.18",
              + "fd7a:115c:a1e0::1101:9712",
            ]
          + hostname  = "tf-coreos-periphery-I3k"
          + id        = "5607172247468345"
          + name      = "tf-coreos-periphery-i3k.shark-perch.ts.net"
          + node_id   = "nSqfebuVnk11CNTRL"
          + tags      = [
              + "tag:periphery",
            ]
          + user      = ""
        },
    ]
```
</details>
<!-- placeholder-5 -->
<!-- terraform-37-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->